# Brewfile — managed via `brew bundle`
# Run: brew bundle  (install)
#      brew bundle check  (verify)

# ---------- Taps ----------
tap "homebrew/bundle"

# ---------- CLI tools ----------
brew "chezmoi"    # dotfiles manager
brew "git"
brew "gh"         # GitHub CLI
brew "jq"         # JSON processor
brew "yq"         # YAML/JSON/TOML processor
brew "ripgrep"    # fast grep (rg)
brew "fd"         # fast find
brew "fzf"        # fuzzy finder
brew "bat"        # cat with syntax highlighting
brew "eza"        # modern ls
brew "starship"   # cross-shell prompt
brew "direnv"     # per-directory env vars
brew "uv"         # fast Python package manager
brew "shellcheck" # shell script linter (used in CI)

# ---------- Casks ----------
cask "ghostty"      # GPU-accelerated terminal
cask "claude"       # Claude desktop (includes claude CLI)
