# ~/.Brewfile — managed by chezmoi (source: home/dot_Brewfile)
# Initial install:  brew bundle --file=<repo>/home/dot_Brewfile
# After apply:      brew bundle --global
# Verify:           brew bundle check --global

# ---------- Taps ----------
tap "homebrew/bundle"
tap "laishulu/homebrew"

# ---------- Core CLI ----------
brew "chezmoi"            # dotfiles manager
brew "git"
brew "git-delta"          # better git diff
brew "git-lfs"            # large file storage
brew "gh"                 # GitHub CLI
brew "ghq"                # Manage local clones
brew "lazygit"            # TUI git client
brew "jq"                 # JSON processor
brew "yq"                 # YAML/JSON/TOML processor

# ---------- Shell / prompt ----------
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "starship"           # cross-shell prompt
brew "atuin"              # shell history (sync + search)
brew "direnv"             # per-directory env vars
brew "zoxide"             # smart cd
brew "navi"               # interactive cheatsheet

# ---------- File / search ----------
brew "ripgrep"            # fast grep (rg)
brew "fd"                 # fast find
brew "fzf"                # fuzzy finder
brew "bat"                # cat with syntax highlight
brew "eza"                # modern ls
brew "yazi"               # TUI file manager
brew "poppler"            # PDF utilities (pdftoppm, pdfinfo, etc.)
brew "vim"

# ---------- Terminal multiplexer ----------
brew "zellij"            # terminal multiplexer

# ---------- Runtimes / package managers ----------
brew "uv"                 # fast Python package manager

# ---------- Infrastructure / cloud ----------
brew "awscli"
brew "azure-cli"
brew "tfenv"              # Terraform version manager

# ---------- Misc CLI ----------
brew "hugo"               # static site generator
brew "shellcheck"         # shell script linter (used in CI)
brew "laishulu/homebrew/macism"  # input method switcher

# ---------- Casks: terminals / editors ----------
cask "ghostty"            # GPU-accelerated terminal
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "cursor"             # AI editor

# ---------- Casks: AI ----------
cask "claude"             # Claude desktop
cask "claude-code"        # Claude Code CLI

# ---------- Casks: browsers ----------
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome"

# ---------- Casks: cloud / infra ----------
cask "gcloud-cli", args: { appdir: "/Applications" }
cask "aws-vault-binary", args: { appdir: "/Applications" }

# ---------- Casks: productivity ----------
cask "raycast"            # launcher
cask "alt-tab", args: { appdir: "/Applications" }  # window switcher
cask "cleanshot", args: { appdir: "/Applications" }  # screenshot tool
cask "bitwarden", args: { appdir: "/Applications" }
cask "ente-auth"          # 2FA

# ---------- Casks: media / misc ----------
cask "iina"               # video player
cask "discord", args: { appdir: "/Applications" }
cask "transmission-remote-gui"

# ---------- Casks: system / drivers ----------
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "google-japanese-ime"
cask "logi-options+"
